import numpy as np

# 研究.reshape(a,b,c...): 改变数组的'形状': 可以从'低维'变成'多维', 也可以从'多维'变成'低维' (如将鸡蛋从 6x4 排变 成 3x2x2x2, 二维数组 变四维)
"""
e.g.,  给定一个 12x2 的数组 
[[1,2,3,4,5,6,7,8,9,10,11,12], [13,14,15,16,17,18,19,20,21,22,23,24]]

--> reshape(3,2,4)
[[[ 1  2  3  4]
  [ 5  6  7  8]]

 [[ 9 10 11 12]
  [13 14 15 16]]

 [[17 18 19 20]
  [21 22 23 24]]]
"""
two_d_arr = np.array([[1,2,3,4,5,6,7,8,9,10,11,12],[13,14,15,16,17,18,19,20,21,22,23,24]]); # 使用np.array()创建一个二维的Numpy数组 (12 x 2)
three_d_arr = two_d_arr.reshape(3,2,4); # 将原二维数组转成三维数组, 最外层3个列表, 每个列表各'内嵌两个列表', 每个'内嵌列表'中有4个元素 (3x2x4)
print(f"reshape后的three_d_arr: \n{three_d_arr}");

print("========================================")

# Tips: reshape中有个'-1'的参数, 表示此处的值(列表/元素数)'自动交给'Numpy算, 相当于一个'自动算'的占位符 (-1只能出现一次)
# 接上上面的例子, two_d_arr 共有24个元素, 可以拆成 3x2x4, 我们就可以用'-1'来代表这里的'任何一个数'
three_d_arr = two_d_arr.reshape(3,-1,4); # Numpy会自己算出 此处的'-1' 为 '2' (24 / 3 / 4 = 2);
print(f"reshape(3,-1,4)得到的的three_d_arr: \n{three_d_arr}"); # 输出和上面完全一样

print("========================================")
# 理解 array[:], array[::]
## 这些':'指代的是一种'切片'写法,即是从已有的Numpy / Python数组中 '规律的'摘出一些数据
"""
array[起始索引 : 终止索引] --> 取出对应'索引范围'的值 (e.g., array[2:6] --> 从下标2取到下标5!)
注: '起始索引'会被取, 但'终止索引'不会被取! [起始索引, 终止索引)
Tips: 起始索引 & 终止索引 在"不写"时都有'默认值'填充, 起始索引=0, 终止索引='最后一个元素'下标+1

而'array[::]', 就是上面写法的一个'简单加强', 多了一个'取元素步长'
array[起始索引 : 终止索引 : 步长] ---> 在指定范围中, 每'隔多少元素'('步长-1'个元素)取一个值 
(e.g., array[2:6:2] --> 在下标[2,6)的范围中, 每隔'一个元素'取一个值, '开头元素'一定会被取)
Tips: [::]中每个值在不写时都有个'默认值': 起始索引=0, 终止索引=最后一个下标+1, 步长=1
也就是说, [::]在什么都不写时, 就等同于 [:]  ( [0:last_index+1:1] === [0:last_index+1] === 从头到尾"每个都取" XD)

上述两个写法都是针对'一维数组'的操作, 可以嵌套在'多维数组'中对 每个层的'一维数组'套用

"""
one_d_array = np.array([0,1,2,3,4,5,6,7,8,9]);
print(f"one_d_array[:]: {one_d_array[:]}"); # 取出'所有'元素, 组成一个'新数组' [0,1,2,3,4,5,6,7,8,9]
print(f"one_d_array[2:6]: {one_d_array[2:6]}"); # 取出[2,6)下标的所有元素 [2,3,4,5]
print(f"one_d_array[2:8:2]: {one_d_array[1:8:3]}"); # 在[1,8)的下标中, 每隔'两个元素' (3-1) 取一个值 [1,4,7]

# 在多维数组中操作每个 '一维数组' / 当前'维度层'的元素 (这里继续沿用上面的three_d_array, 三维数组)
# Tips: N维数字 = N个'可操作层'
## three_d_array 是个3三维数组 (三个'可操作层', 3组 x 2组 x 4个)
#  任务: 最外层(第一层) 只要1,3组; 第二层全要; 第三层(最内层) 只要 1,3 下标的元素 (隔一个元素取一个)

extracted_arr = three_d_arr[0:3:2, ::, 1:4:2];
print(f"外层 1 & 3组, 中层全要, 内层只要第二第四元素 three_d_arr[0:3:2, ::, 1:4:2]: \n{extracted_arr}");