import numpy as np

# 研究.reshape(a,b,c...): 改变数组的'形状': 可以从'低维'变成'多维', 也可以从'多维'变成'低维' (如将鸡蛋从 6x4 排变 成 3x2x2x2, 二维数组 变四维)
"""
e.g.,  给定一个 12x2 的数组 
[[1,2,3,4,5,6,7,8,9,10,11,12], [13,14,15,16,17,18,19,20,21,22,23,24]]

--> reshape(3,2,4)
[[[ 1  2  3  4]
  [ 5  6  7  8]]

 [[ 9 10 11 12]
  [13 14 15 16]]

 [[17 18 19 20]
  [21 22 23 24]]]
"""
two_d_arr = np.array([[1,2,3,4,5,6,7,8,9,10,11,12],[13,14,15,16,17,18,19,20,21,22,23,24]]); # 使用np.array()创建一个二维的Numpy数组 (12 x 2)
three_d_arr = two_d_arr.reshape(3,2,4); # 将原二维数组转成三维数组, 最外层3个列表, 每个列表各'内嵌两个列表', 每个'内嵌列表'中有4个元素 (3x2x4)
print(f"reshape后的three_d_arr: \n{three_d_arr}");

print("========================================")

# Tips: reshape中有个'-1'的参数, 表示此处的值(列表/元素数)'自动交给'Numpy算, 相当于一个'自动算'的占位符 (-1只能出现一次)
# 接上上面的例子, two_d_arr 共有24个元素, 可以拆成 3x2x4, 我们就可以用'-1'来代表这里的'任何一个数'
three_d_arr = two_d_arr.reshape(3,-1,4); # Numpy会自己算出 此处的'-1' 为 '2' (24 / 3 / 4 = 2);
print(f"reshape(3,-1,4)得到的的three_d_arr: \n{three_d_arr}"); # 输出和上面完全一样